# Задача 4: Словарь студентов и предметов
# Дан словарь, где ключами являются имена студентов, а значениями — список предметов, которые они изучают. Необходимо найти студентов, которые изучают определённый предмет.
# Входные данные: словарь студентов и предметов, а также строка с названием предмета.
# Вывести список студентов, которые изучают этот предмет.
# студенты = {'Иван': ['математика', 'физика'],
#             'Мария': ['химия', 'биология'],
#             'Петр': ['математика', 'информатика'],
#             'Анна': ['биология', 'физика']}
#
# предмет = 'математика'
# Ожидаемый результат:
# ['Иван', 'Петр']

